%%
x_speech = [50,100,150,200,250,300,350,400,450,500,550,600,650];
y_speech_train_hmm_5_0 = [0,0.0010,0.0133,0.0085,0.0080,0.0206,0.0340,0.0367,0.0524,0.0532,0.0527,0.0738,0.0695];
y_speech_test_hmm_5_0 = [0.4322,0.4295,0.3827,0.3495,0.3618,0.3350,0.1868,0.1536,0.1436,0.1254,0.1172,0.1177,0.1113];
y_speech_val_hmm_5_0 = 0.5;

y_speech_train_hcrf_5_0 = [0 0 0.000666666666666667 0.00200000000000000 0.00640000000000000 0.00366666666666667 0.0225714285714286 0.0265000000000000 0.0317777777777778 0.0300000000000000 0.0416363636363636 0.0516666666666667 0.0326153846153846];
y_speech_test_hcrf_5_0 = [0.447727272727273 0.381363636363636 0.345000000000000 0.328181818181818 0.334090909090909 0.260454545454545 0.168181818181818 0.0881818181818182 0.0936363636363636 0.0872727272727273 0.0713636363636364 0.0627272727272727 0.0722727272727273];
y_speech_val_hcrf_5_0 = 0.5;

y_speech_train_npmpgm_10_10 = [0 0 0 0 0.000400000000000000 0.000333333333333333 0.000571428571428572 0.00125000000000000 0.00133333333333333 0.00380000000000000 0.00200000000000000 0.00500000000000000 0.00584615384615385];
y_speech_test_npmpgm_10_10 = [0.330454545454545 0.326363636363636 0.328636363636364 0.360000000000000 0.360000000000000 0.374545454545455 0.164545454545455 0.155454545454545 0.155454545454545 0.133181818181818 0.146363636363636 0.149545454545455 0.146363636363636];
y_speech_val_npmpgm_10_10 = 0.5;
%%
x_char = [6 12 18 24 30 36 42 48];
y_char_train_hmm_7_0 = [0.00833333333333333 0.00416666666666667 0.0333333333333333 0.0187500000000000 0.0233333333333333 0.0277777777777778 0.0285714285714286 0.0354166666666667];
y_char_test_hmm_7_0 = [0.478000000000000 0.412000000000000 0.381000000000000 0.416000000000000 0.327000000000000 0.368000000000000 0.327000000000000 0.332000000000000];
y_char_val_hmm_7_0 = 0.5;

y_char_train_hcrf_7_0 = [0 0 0 0.00208333333333333 0 0 0 0];
y_char_test_hcrf_7_0 = [0.465000000000000 0.383000000000000 0.344000000000000 0.332000000000000 0.279000000000000 0.241000000000000 0.281000000000000 0.220000000000000];
y_char_val_hcrf_7_0 = 0.2159;

y_char_train_npmpgm_4_4 = [0.00833333333333333 0.0125000000000000 0.0222222222222222 0.0125000000000000 0.0100000000000000 0.0208333333333333 0.0178571428571429 0.0354166666666667];
y_char_test_npmpgm_4_4 = [0.272000000000000 0.261000000000000 0.245000000000000 0.238000000000000 0.218000000000000 0.259000000000000 0.274000000000000 0.247000000000000];
y_char_val_npmpgm_4_4 = 0.2013;

y_char_train_npmpgm_4_4m = [0.00833333333333333 0.0125000000000000 0.0222222222222222 0.0125000000000000 0.0100000000000000 0.0208333333333333 0.0178571428571429 0.0354166666666667];
y_char_test_npmpgm_4_4m = [0.272000000000000 0.261000000000000 0.245000000000000 0.238000000000000 0.218000000000000 0.259000000000000 0.274000000000000 0.210000000000000];
y_char_val_npmpgm_4_4m = 0.2013;
%%
x_acs = [5 10 15 20];
%y_acs_train_hmm_9_16 = [0 0 0.00952380952380953 0.0142857142857143];
%y_acs_test_hmm_9_16 = [0.505714285714286 0.392857142857143 0.391428571428571 0.381428571428571];
%y_acs_val_hmm_9_16 = 0.3886;

y_acs_train_hmm_9_3 = [0.0285714285714286 0.0857142857142857 0.0571428571428571 0.0571428571428571];
y_acs_test_hmm_9_3 = [0.452857142857143 0.412857142857143 0.402857142857143 0.392857142857143];
y_acs_val_hmm_9_3 = 0.3886;

y_acs_train_npmpgm_15_15 = [0 0 0 0.00714285714285714];
y_acs_test_npmpgm_15_15 = [0.398571428571429 0.361428571428571 0.327142857142857 0.345714285714286];
y_acs_test_npmpgm_15_15m = [0.398571428571429 0.361428571428571 0.327142857142857 0.293714285714286];
y_acs_val_npmpgm_15_15 = 0.2851;
%%
TYPE = 1;
%%
if TYPE == 1
    x1 = x_char;
    y1 = y_char_train_npmpgm_4_4m;
    y2 = y_char_test_npmpgm_4_4m;   
    y3 = y_char_val_npmpgm_4_4m;
    set(0,'DefaultAxesFontSize',14,'DefaultAxesFontName','Times New Roman');
    set(0,'DefaultTextFontSize',14,'DefaultTextFontName','Times New Roman');
    %figure('Units', 'normalized', 'OuterPosition', [0 0 1 1]);
    title('HMM');
    hold on;
    grid on;    
    plot(x1, y1,'r','LineWidth',3);
    plot(x1, y2,'--','Color',[.1 .4 .1],'LineWidth',3);
    %plot(x1, repmat(min(y2),size(x1,1),size(x1,2)),'black','LineWidth',1);
    plot(x1, repmat(y3,size(x1,1),size(x1,2)),'black','LineWidth',1);
    axis([min(x1),max(x1),0,0.6])
    legend('Ошибка на обучающей выборке','Ошибка на тестовой выборке', 1);
    BX=get(gca,'XTick');
    BY=get(gca,'YTick');
else
    x1 = x_char;
    y1 = y_char_test_hmm_7_0;
    y2 = y_char_test_hcrf_7_0;
    y3 = y_char_test_npmpgm_4_4m;
    set(0,'DefaultAxesFontSize',14,'DefaultAxesFontName','Times New Roman');
    set(0,'DefaultTextFontSize',14,'DefaultTextFontName','Times New Roman');
    %figure('Units', 'normalized', 'OuterPosition', [0 0 1 1]);
    %title('Название');
    hold on;
    grid on;
    plot(x1, y1,'r','LineWidth',3);
    plot(x1, y2,'--','Color',[.1 .4 .1],'LineWidth',3);
    plot(x1, y3,':','Color',[.8 .6 .1],'LineWidth',3);
    axis([min(x1),max(x1),0,0.6])
    legend('HMM','HCRF','NPM-PGM', 1);
    BX=get(gca,'XTick');
    BY=get(gca,'YTick');
end;
%%
%xlabel('Количество обучающих данных','Position',[BX(size(BX,2)) BY(1)])
%ylabel('Ошибка классификации','Rotation',0,'Position',[BX(1) BY(size(BY,2))])
xlabel('Количество обучающих данных')
ylabel('Ошибка классификации')

XA=get(gca,'XTickLabel');%

for i=1:size(XA,1)

    z=rem(i,2);
    if z==0;
        if XA(i,1)~='0' && XA(i,2)~=0
            XA(i,:)=char(0);
        end
    end
    
end

XA(size(XA,1),:)=char(0);

set(gca,'XTickLabel',XA);

YA=get(gca,'YTickLabel');%

for i=1:size(YA,1)

    z=strfind(YA(i,:),'.');
    YA(i,z)=',';
    clear z;
    z=rem(i,2);
    if z~=0; 
        YA(i,:)=char(0);
    end
    
end

YA(size(YA,1),:)=char(0);

set(gca,'YTickLabel',YA);

%xlabel('Sample Size');
%ylabel('Error');
